Autodesk.Revit.DB.ViewCropRegionShapeManager.GetSplitRegionOffset(System.Int32)
Returns the offset for the specified split crop region.
Remarks:
The points in the split crop region's boundary are not in model space.
Add the offset returned by this method to each point in the crop region's
boundary to transform the points into model space coordinates.
regionIndex:
Index of the split crop region (numbering starts with 0).
Returns:
A vector in model space representing the offset which is applied to the split crop region's boundary.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided region index is invalid.
Since:
2020.1